Catalogs/Доставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Доставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокиДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСуммаЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Доставки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоставДоставкиСуммаПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СоставДоставкиЦенаЗаЕдПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СоставДоставкиКоличествоПриИзменении(Элемент)
	ТаблицаСоставДоставки=Элементы.СоставДоставки.ТекущиеДанные;
	ТаблицаСоставДоставки.Сумма=ТаблицаСоставДоставки.Количество*ТаблицаСоставДоставки.ЦенаЗаЕд;
	Объект.ИтоговаяСуммаЗаказа = Объект.СоставДоставки.Итог("Сумма");
КонецПроцедуры
